Jiu-xiao/libxr/driver/mspm0/mspm0_i2c.cpp
#include "mspm0_i2c.hpp"

#include <ti/driverlib/dl_dma.h>

#include <cstdint>
#include <cstring>

using namespace LibXR;

namespace
{

constexpr uint32_t MSPM0_I2C_WAIT_IDLE_TIMEOUT = 300000;
constexpr uint32_t MSPM0_I2C_WAIT_BUS_TIMEOUT = 300000;
constexpr uint32_t MSPM0_I2C_WAIT_FIFO_TIMEOUT = 300000;
constexpr uint32_t MSPM0_I2C_POLLING_ATTEMPTS = 2;
constexpr uint32_t MSPM0_I2C_MEMREAD_RS_ATTEMPTS = 2;
constexpr uint32_t MSPM0_I2C_MEMREAD_FALLBACK_ATTEMPTS = 3;

constexpr uint16_t MSPM0_I2C_MAX_TRANSFER_SIZE = 0x0FFF;

// 两个 DMA 绑定都存在时才启用 DMA；未绑定时保留轮询 I2C。
// Enable DMA only when both channels are bound; otherwise retain polling I2C.
#if defined(DMA_CH_TX_CHAN_ID) != defined(DMA_CH_RX_CHAN_ID)
#error "MSPM0I2C requires both TX and RX DMA bindings, or neither."
#endif
#if defined(DMA_CH_TX_CHAN_ID) && defined(DMA_CH_RX_CHAN_ID)
constexpr bool I2C_DMA_CONFIGURED = true;
constexpr uint8_t I2C_DMA_TX_CHANNEL = DMA_CH_TX_CHAN_ID;
constexpr uint8_t I2C_DMA_RX_CHANNEL = DMA_CH_RX_CHAN_ID;
static_assert(DMA_CH_TX_CHAN_ID < DMA_SYS_N_DMA_CHANNEL);
static_assert(DMA_CH_RX_CHAN_ID < DMA_SYS_N_DMA_CHANNEL);
static_assert(DMA_CH_TX_CHAN_ID != DMA_CH_RX_CHAN_ID);
#else
constexpr bool I2C_DMA_CONFIGURED = false;
// Unused placeholders: no DMA register may be accessed in polling-only mode.
constexpr uint8_t I2C_DMA_TX_CHANNEL = 0U;
constexpr uint8_t I2C_DMA_RX_CHANNEL = 0U;
#endif

constexpr DL_DMA_Config MSPM0_I2C_DMA_TX_CONFIG_BASE = {
    .trigger = 0U,
    .triggerType = DL_DMA_TRIGGER_TYPE_EXTERNAL,
    .transferMode = DL_DMA_SINGLE_TRANSFER_MODE,
    .extendedMode = DL_DMA_NORMAL_MODE,
    .srcWidth = DL_DMA_WIDTH_BYTE,
    .destWidth = DL_DMA_WIDTH_BYTE,
    .srcIncrement = DL_DMA_ADDR_INCREMENT,
    .destIncrement = DL_DMA_ADDR_UNCHANGED,
};

constexpr DL_DMA_Config MSPM0_I2C_DMA_RX_CONFIG_BASE = {
    .trigger = 0U,
    .triggerType = DL_DMA_TRIGGER_TYPE_EXTERNAL,
    .transferMode = DL_DMA_SINGLE_TRANSFER_MODE,
    .extendedMode = DL_DMA_NORMAL_MODE,
    .srcWidth = DL_DMA_WIDTH_BYTE,
    .destWidth = DL_DMA_WIDTH_BYTE,
    .srcIncrement = DL_DMA_ADDR_UNCHANGED,
    .destIncrement = DL_DMA_ADDR_INCREMENT,
};

constexpr uint32_t mspm0_i2c_dma_channel_mask(uint8_t channel_id)
{
  return (1UL << channel_id);
}

bool mspm0_i2c_resolve_dma_triggers(I2C_Regs* instance, uint8_t& tx_trigger,
                                    uint8_t& rx_trigger)
{
#if defined(I2C0_BASE) && defined(DMA_I2C0_TX_TRIG) && defined(DMA_I2C0_RX_TRIG)
  if (instance == I2C0)
  {
    tx_trigger = DMA_I2C0_TX_TRIG;
    rx_trigger = DMA_I2C0_RX_TRIG;
    return true;
  }
#endif
#if defined(I2C1_BASE) && defined(DMA_I2C1_TX_TRIG) && defined(DMA_I2C1_RX_TRIG)
  if (instance == I2C1)
  {
    tx_trigger = DMA_I2C1_TX_TRIG;
    rx_trigger = DMA_I2C1_RX_TRIG;
    return true;
  }
#endif
#if defined(I2C2_BASE) && defined(DMA_I2C2_TX_TRIG) && defined(DMA_I2C2_RX_TRIG)
  if (instance == I2C2)
  {
    tx_trigger = DMA_I2C2_TX_TRIG;
    rx_trigger = DMA_I2C2_RX_TRIG;
    return true;
  }
#endif
#if defined(I2C3_BASE) && defined(DMA_I2C3_TX_TRIG) && defined(DMA_I2C3_RX_TRIG)
  if (instance == I2C3)
  {
    tx_trigger = DMA_I2C3_TX_TRIG;
    rx_trigger = DMA_I2C3_RX_TRIG;
    return true;
  }
#endif
  return false;
}

constexpr bool mspm0_i2c_is_valid_addr7(uint16_t slave_addr)
{
  return slave_addr <= 0x7FU;
}

void mspm0_i2c_recover_controller(I2C_Regs* instance)
{
  DL_I2C_disableInterrupt(instance, 0xFFFFFFFFU);
  DL_I2C_clearInterruptStatus(instance, 0xFFFFFFFFU);
  DL_I2C_disableControllerReadOnTXEmpty(instance);
  DL_I2C_resetControllerTransfer(instance);
  DL_I2C_enableController(instance);
}

}  // namespace

MSPM0I2C::MSPM0I2C(Resources res, RawData stage_buffer, uint32_t dma_enable_min_size,
                   I2C::Configuration config)
    : I2C(),
      res_(res),
      stage_buffer_(stage_buffer),
      dma_enable_min_size_(dma_enable_min_size)
{
  ASSERT(res_.instance != nullptr);
  ASSERT(res_.clock_freq > 0);
  ASSERT(res_.index < MAX_I2C_INSTANCES);
  ASSERT(stage_buffer_.addr_ != nullptr);
  ASSERT(stage_buffer_.size_ > 0);

  if (config.clock_speed == 0)
  {
    config.clock_speed = res_.default_bus_speed_hz;
  }
  const ErrorCode SET_CFG_ANS = SetConfig(config);
  ASSERT(SET_CFG_ANS == ErrorCode::OK);
}

ErrorCode MSPM0I2C::CheckControllerError() const
{
  const uint32_t STATUS = DL_I2C_getControllerStatus(res_.instance);
  if ((STATUS & DL_I2C_CONTROLLER_STATUS_ERROR) != 0 ||
      (STATUS & DL_I2C_CONTROLLER_STATUS_ARBITRATION_LOST) != 0)
  {
    return ErrorCode::FAILED;
  }
  return ErrorCode::OK;
}

ErrorCode MSPM0I2C::WaitControllerIdle() const
{
  uint32_t timeout = MSPM0_I2C_WAIT_IDLE_TIMEOUT;
  while (timeout-- > 0)
  {
    if ((DL_I2C_getControllerStatus(res_.instance) & DL_I2C_CONTROLLER_STATUS_IDLE) != 0)
    {
      return ErrorCode::OK;
    }
    if (CheckControllerError() != ErrorCode::OK)
    {
      return ErrorCode::FAILED;
    }
  }
  return ErrorCode::BUSY;
}

ErrorCode MSPM0I2C::WaitTransactionDone() const
{
  uint32_t timeout = MSPM0_I2C_WAIT_FIFO_TIMEOUT;
  while (timeout-- > 0)
  {
    if (DL_I2C_getTransactionCount(res_.instance) == 0)
    {
      return ErrorCode::OK;
    }
    if (CheckControllerError() != ErrorCode::OK)
    {
      return ErrorCode::FAILED;
    }
  }
  return ErrorCode::BUSY;
}

ErrorCode MSPM0I2C::WaitBusIdle() const
{
  uint32_t timeout = MSPM0_I2C_WAIT_BUS_TIMEOUT;
  while (timeout-- > 0)
  {
    if ((DL_I2C_getControllerStatus(res_.instance) & DL_I2C_CONTROLLER_STATUS_BUSY_BUS) ==
        0)
    {
      return ErrorCode::OK;
    }
    if (CheckControllerError() != ErrorCode::OK)
    {
      return ErrorCode::FAILED;
    }
  }
  return ErrorCode::BUSY;
}

ErrorCode MSPM0I2C::SetConfig(Configuration config)
{
  if (res_.instance == nullptr || res_.clock_freq == 0U || config.clock_speed == 0U)
  {
    return ErrorCode::ARG_ERR;
  }
  if (config.clock_speed > 1000000U)
  {
    return ErrorCode::NOT_SUPPORT;
  }

  // SCL = BUSCLK / (10 * (TPR + 1)); round up to avoid exceeding the request.
  const uint64_t PERIOD_DEN = uint64_t(config.clock_speed) * 10U;
  const uint64_t period_factor =
      (uint64_t(res_.clock_freq) + PERIOD_DEN - 1U) / PERIOD_DEN;
  if (period_factor == 0)
  {
    return ErrorCode::NOT_SUPPORT;
  }
  if (period_factor > 128U)
  {
    return ErrorCode::NOT_SUPPORT;
  }

  if ((DL_I2C_getControllerStatus(res_.instance) &
       (DL_I2C_CONTROLLER_STATUS_BUSY | DL_I2C_CONTROLLER_STATUS_BUSY_BUS)) != 0U)
  {
    return ErrorCode::BUSY;
  }

  const uint8_t TIMER_PERIOD = static_cast<uint8_t>(period_factor - 1U);
  const DL_I2C_ClockConfig CLOCK_CONFIG = {
      .clockSel = DL_I2C_CLOCK_BUSCLK,
      .divideRatio = DL_I2C_CLOCK_DIVIDE_1,
  };

