Jiu-xiao/libxr/driver/mspm0/mspm0_i2c.cpp
  uint8_t dma_tx_trigger = 0U;
  uint8_t dma_rx_trigger = 0U;
  const bool USE_DMA =
      I2C_DMA_CONFIGURED &&
      mspm0_i2c_resolve_dma_triggers(res_.instance, dma_tx_trigger, dma_rx_trigger);
  dma_enabled_ = USE_DMA;

  DL_I2C_disableController(res_.instance);
  DL_I2C_setClockConfig(res_.instance, &CLOCK_CONFIG);
  DL_I2C_resetControllerTransfer(res_.instance);
  DL_I2C_setTimerPeriod(res_.instance, TIMER_PERIOD);
  DL_I2C_setControllerTXFIFOThreshold(
      res_.instance, USE_DMA ? DL_I2C_TX_FIFO_LEVEL_EMPTY : DL_I2C_TX_FIFO_LEVEL_BYTES_1);
  DL_I2C_setControllerRXFIFOThreshold(res_.instance, DL_I2C_RX_FIFO_LEVEL_BYTES_1);
  DL_I2C_enableControllerClockStretching(res_.instance);
  DL_I2C_disableInterrupt(res_.instance, 0xFFFFFFFFU);
  DL_I2C_clearInterruptStatus(res_.instance, 0xFFFFFFFFU);

  DL_I2C_disableDMAEvent(res_.instance, DL_I2C_EVENT_ROUTE_1,
                         DL_I2C_DMA_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER);
  DL_I2C_disableDMAEvent(res_.instance, DL_I2C_EVENT_ROUTE_2,
                         DL_I2C_DMA_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER);
  if (USE_DMA)
  {
    DL_DMA_disableChannel(DMA, I2C_DMA_TX_CHANNEL);
    DL_DMA_disableChannel(DMA, I2C_DMA_RX_CHANNEL);
    DL_DMA_clearInterruptStatus(DMA, mspm0_i2c_dma_channel_mask(I2C_DMA_TX_CHANNEL) |
                                         mspm0_i2c_dma_channel_mask(I2C_DMA_RX_CHANNEL));
  }

  if (USE_DMA)
  {
    DL_DMA_Config dma_tx_config = MSPM0_I2C_DMA_TX_CONFIG_BASE;
    DL_DMA_Config dma_rx_config = MSPM0_I2C_DMA_RX_CONFIG_BASE;
    dma_tx_config.trigger = dma_tx_trigger;
    dma_rx_config.trigger = dma_rx_trigger;

    DL_I2C_enableDMAEvent(res_.instance, DL_I2C_EVENT_ROUTE_1,
                          DL_I2C_DMA_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER);
    DL_I2C_enableDMAEvent(res_.instance, DL_I2C_EVENT_ROUTE_2,
                          DL_I2C_DMA_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER);
    DL_DMA_initChannel(DMA, I2C_DMA_TX_CHANNEL, &dma_tx_config);
    DL_DMA_initChannel(DMA, I2C_DMA_RX_CHANNEL, &dma_rx_config);
  }

  DL_I2C_enableController(res_.instance);

  return ErrorCode::OK;
}

ErrorCode MSPM0I2C::PollingWrite7(uint16_t addr7, const uint8_t* data, size_t size)
{
  if (size == 0)
  {
    return ErrorCode::OK;
  }
  if (size > MSPM0_I2C_MAX_TRANSFER_SIZE)
  {
    return ErrorCode::ARG_ERR;
  }

  auto attempt_once = [&]() -> ErrorCode
  {
    ErrorCode ans = WaitControllerIdle();
    if (ans != ErrorCode::OK)
    {
      return ans;
    }

    DL_I2C_clearInterruptStatus(res_.instance, 0xFFFFFFFFU);

    size_t sent =
        DL_I2C_fillControllerTXFIFO(res_.instance, data, static_cast<uint16_t>(size));
    DL_I2C_startControllerTransfer(res_.instance, addr7, DL_I2C_CONTROLLER_DIRECTION_TX,
                                   static_cast<uint16_t>(size));

    while (sent < size)
    {
      uint32_t timeout = MSPM0_I2C_WAIT_FIFO_TIMEOUT;
      while (DL_I2C_getRawInterruptStatus(
                 res_.instance, DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER) == 0U)
      {
        if (CheckControllerError() != ErrorCode::OK)
        {
          return ErrorCode::FAILED;
        }
        if (timeout-- == 0)
        {
          return ErrorCode::BUSY;
        }
      }

      sent += DL_I2C_fillControllerTXFIFO(res_.instance, data + sent,
                                          static_cast<uint16_t>(size - sent));
    }

    ans = WaitBusIdle();
    if (ans != ErrorCode::OK)
    {
      return ans;
    }

    return CheckControllerError();
  };

  ErrorCode last_error = ErrorCode::FAILED;
  for (uint32_t attempt = 0; attempt < MSPM0_I2C_POLLING_ATTEMPTS; ++attempt)
  {
    last_error = attempt_once();
    if (last_error == ErrorCode::OK)
    {
      return ErrorCode::OK;
    }
    mspm0_i2c_recover_controller(res_.instance);
  }

  return last_error;
}

ErrorCode MSPM0I2C::PollingRead7(uint16_t addr7, uint8_t* data, size_t size)
{
  if (size == 0)
  {
    return ErrorCode::OK;
  }
  if (size > MSPM0_I2C_MAX_TRANSFER_SIZE)
  {
    return ErrorCode::ARG_ERR;
  }

  auto attempt_once = [&]() -> ErrorCode
  {
    ErrorCode ans = WaitControllerIdle();
    if (ans != ErrorCode::OK)
    {
      return ans;
    }

    DL_I2C_clearInterruptStatus(res_.instance, 0xFFFFFFFFU);
    DL_I2C_startControllerTransfer(res_.instance, addr7, DL_I2C_CONTROLLER_DIRECTION_RX,
                                   static_cast<uint16_t>(size));

    size_t received = 0;
    while (received < size)
    {
      uint32_t timeout = MSPM0_I2C_WAIT_FIFO_TIMEOUT;
      while (DL_I2C_isControllerRXFIFOEmpty(res_.instance))
      {
        if (CheckControllerError() != ErrorCode::OK)
        {
          return ErrorCode::FAILED;
        }
        if (timeout-- == 0)
        {
          return ErrorCode::BUSY;
        }
      }

      while (!DL_I2C_isControllerRXFIFOEmpty(res_.instance) && received < size)
      {
        data[received++] = DL_I2C_receiveControllerData(res_.instance);
      }
    }

    ans = WaitBusIdle();
    if (ans != ErrorCode::OK)
    {
      return ans;
    }

    return CheckControllerError();
  };

  ErrorCode last_error = ErrorCode::FAILED;
  for (uint32_t attempt = 0; attempt < MSPM0_I2C_POLLING_ATTEMPTS; ++attempt)
  {
    last_error = attempt_once();
    if (last_error == ErrorCode::OK)
    {
      return ErrorCode::OK;
    }
    mspm0_i2c_recover_controller(res_.instance);
  }

  return last_error;
}

ErrorCode MSPM0I2C::WaitDmaTransferDone(uint8_t channel_id) const
{
  uint32_t timeout = MSPM0_I2C_WAIT_FIFO_TIMEOUT;
  while (DL_DMA_getTransferSize(DMA, channel_id) != 0U)
  {
    if (CheckControllerError() != ErrorCode::OK)
    {
      return ErrorCode::FAILED;
    }
    if (timeout-- == 0U)
    {
      return ErrorCode::BUSY;
    }
  }
  return ErrorCode::OK;
}

ErrorCode MSPM0I2C::DmaWrite7(uint16_t addr7, ConstRawData write_data)
{
  if (write_data.size_ == 0)
  {
    return ErrorCode::OK;
  }
  if (write_data.size_ > MSPM0_I2C_MAX_TRANSFER_SIZE)
  {
    return ErrorCode::ARG_ERR;
  }

  auto stop_dma = [&]()
  {
    const uint32_t DMA_TX_MASK = mspm0_i2c_dma_channel_mask(I2C_DMA_TX_CHANNEL);
    DL_DMA_disableChannel(DMA, I2C_DMA_TX_CHANNEL);
    DL_DMA_clearInterruptStatus(DMA, DMA_TX_MASK);
  };

  auto attempt_once = [&]() -> ErrorCode
  {
    ErrorCode ans = WaitControllerIdle();
    if (ans != ErrorCode::OK)
    {
      return ans;
    }

    DL_I2C_disableInterrupt(res_.instance, 0xFFFFFFFFU);
    DL_I2C_clearInterruptStatus(res_.instance, 0xFFFFFFFFU);

    const uint32_t DMA_TX_MASK = mspm0_i2c_dma_channel_mask(I2C_DMA_TX_CHANNEL);
    DL_DMA_disableChannel(DMA, I2C_DMA_TX_CHANNEL);
    DL_DMA_clearInterruptStatus(DMA, DMA_TX_MASK);
    DL_DMA_setSrcAddr(
        DMA, I2C_DMA_TX_CHANNEL,
        static_cast<uint32_t>(reinterpret_cast<uintptr_t>(write_data.addr_)));
    DL_DMA_setDestAddr(DMA, I2C_DMA_TX_CHANNEL,
                       static_cast<uint32_t>(
                           reinterpret_cast<uintptr_t>(&res_.instance->MASTER.MTXDATA)));
    DL_DMA_setTransferSize(DMA, I2C_DMA_TX_CHANNEL,
                           static_cast<uint16_t>(write_data.size_));
    DL_DMA_enableChannel(DMA, I2C_DMA_TX_CHANNEL);

    DL_I2C_startControllerTransfer(res_.instance, addr7, DL_I2C_CONTROLLER_DIRECTION_TX,
                                   static_cast<uint16_t>(write_data.size_));

    ans = WaitDmaTransferDone(I2C_DMA_TX_CHANNEL);
    if (ans != ErrorCode::OK)
    {
      stop_dma();
      return ans;
    }

    ans = WaitTransactionDone();
    if (ans != ErrorCode::OK)
    {
      stop_dma();
      return ans;
    }

    ans = WaitBusIdle();
    if (ans != ErrorCode::OK)
    {
      stop_dma();
      return ans;
    }

    stop_dma();
    return CheckControllerError();
  };

