Jiu-xiao/libxr/driver/mspm0/mspm0_i2c.cpp
  ErrorCode last_error = ErrorCode::FAILED;
  for (uint32_t attempt = 0; attempt < MSPM0_I2C_POLLING_ATTEMPTS; ++attempt)
  {
    last_error = attempt_once();
    if (last_error == ErrorCode::OK)
    {
      return ErrorCode::OK;
    }
    mspm0_i2c_recover_controller(res_.instance);
  }

  return last_error;
}

ErrorCode MSPM0I2C::DmaRead7(uint16_t addr7, RawData read_data)
{
  if (read_data.size_ == 0)
  {
    return ErrorCode::OK;
  }
  if (read_data.size_ > MSPM0_I2C_MAX_TRANSFER_SIZE)
  {
    return ErrorCode::ARG_ERR;
  }

  auto stop_dma = [&]()
  {
    const uint32_t DMA_RX_MASK = mspm0_i2c_dma_channel_mask(I2C_DMA_RX_CHANNEL);
    DL_DMA_disableChannel(DMA, I2C_DMA_RX_CHANNEL);
    DL_DMA_clearInterruptStatus(DMA, DMA_RX_MASK);
  };

  auto attempt_once = [&]() -> ErrorCode
  {
    ErrorCode ans = WaitControllerIdle();
    if (ans != ErrorCode::OK)
    {
      return ans;
    }

    DL_I2C_disableInterrupt(res_.instance, 0xFFFFFFFFU);
    DL_I2C_clearInterruptStatus(res_.instance, 0xFFFFFFFFU);

    const uint32_t DMA_RX_MASK = mspm0_i2c_dma_channel_mask(I2C_DMA_RX_CHANNEL);
    DL_DMA_disableChannel(DMA, I2C_DMA_RX_CHANNEL);
    DL_DMA_clearInterruptStatus(DMA, DMA_RX_MASK);
    DL_DMA_setSrcAddr(DMA, I2C_DMA_RX_CHANNEL,
                      static_cast<uint32_t>(
                          reinterpret_cast<uintptr_t>(&res_.instance->MASTER.MRXDATA)));
    DL_DMA_setDestAddr(
        DMA, I2C_DMA_RX_CHANNEL,
        static_cast<uint32_t>(reinterpret_cast<uintptr_t>(read_data.addr_)));
    DL_DMA_setTransferSize(DMA, I2C_DMA_RX_CHANNEL,
                           static_cast<uint16_t>(read_data.size_));
    DL_DMA_enableChannel(DMA, I2C_DMA_RX_CHANNEL);

    DL_I2C_startControllerTransfer(res_.instance, addr7, DL_I2C_CONTROLLER_DIRECTION_RX,
                                   static_cast<uint16_t>(read_data.size_));

    ans = WaitDmaTransferDone(I2C_DMA_RX_CHANNEL);
    if (ans != ErrorCode::OK)
    {
      stop_dma();
      return ans;
    }

    ans = WaitTransactionDone();
    if (ans != ErrorCode::OK)
    {
      stop_dma();
      return ans;
    }

    ans = WaitBusIdle();
    if (ans != ErrorCode::OK)
    {
      stop_dma();
      return ans;
    }

    stop_dma();
    return CheckControllerError();
  };

  ErrorCode last_error = ErrorCode::FAILED;
  for (uint32_t attempt = 0; attempt < MSPM0_I2C_POLLING_ATTEMPTS; ++attempt)
  {
    last_error = attempt_once();
    if (last_error == ErrorCode::OK)
    {
      return ErrorCode::OK;
    }
    mspm0_i2c_recover_controller(res_.instance);
  }

  return last_error;
}

ErrorCode MSPM0I2C::Read(uint16_t slave_addr, RawData read_data, ReadOperation& op,
                         bool in_isr)
{
  if (read_data.size_ == 0)
  {
    if (op.type != ReadOperation::OperationType::BLOCK)
    {
      op.UpdateStatus(in_isr, ErrorCode::OK);
    }
    return ErrorCode::OK;
  }

  if (!mspm0_i2c_is_valid_addr7(slave_addr))
  {
    if (op.type != ReadOperation::OperationType::BLOCK)
    {
      op.UpdateStatus(in_isr, ErrorCode::ARG_ERR);
    }
    return ErrorCode::ARG_ERR;
  }

  const uint16_t ADDR7 = slave_addr;
  ErrorCode ans = ErrorCode::NOT_SUPPORT;
  if (dma_enabled_ && read_data.size_ > dma_enable_min_size_)
  {
    ans = DmaRead7(ADDR7, read_data);
  }
  else
  {
    ans = PollingRead7(ADDR7, static_cast<uint8_t*>(read_data.addr_), read_data.size_);
  }

  if (op.type != ReadOperation::OperationType::BLOCK)
  {
    op.UpdateStatus(in_isr, ans);
  }
  return ans;
}

ErrorCode MSPM0I2C::Write(uint16_t slave_addr, ConstRawData write_data,
                          WriteOperation& op, bool in_isr)
{
  if (write_data.size_ == 0)
  {
    if (op.type != WriteOperation::OperationType::BLOCK)
    {
      op.UpdateStatus(in_isr, ErrorCode::OK);
    }
    return ErrorCode::OK;
  }

  if (!mspm0_i2c_is_valid_addr7(slave_addr))
  {
    if (op.type != WriteOperation::OperationType::BLOCK)
    {
      op.UpdateStatus(in_isr, ErrorCode::ARG_ERR);
    }
    return ErrorCode::ARG_ERR;
  }

  const uint16_t ADDR7 = slave_addr;
  ErrorCode ans = ErrorCode::NOT_SUPPORT;
  if (dma_enabled_ && write_data.size_ > dma_enable_min_size_)
  {
    ans = DmaWrite7(ADDR7, write_data);
  }
  else
  {
    ans = PollingWrite7(ADDR7, static_cast<const uint8_t*>(write_data.addr_),
                        write_data.size_);
  }

  if (op.type != WriteOperation::OperationType::BLOCK)
  {
    op.UpdateStatus(in_isr, ans);
  }
  return ans;
}

ErrorCode MSPM0I2C::MemWrite(uint16_t slave_addr, uint16_t mem_addr,
                             ConstRawData write_data, WriteOperation& op,
                             MemAddrLength mem_addr_size, bool in_isr)
{
  if (!mspm0_i2c_is_valid_addr7(slave_addr))
  {
    if (op.type != WriteOperation::OperationType::BLOCK)
    {
      op.UpdateStatus(in_isr, ErrorCode::ARG_ERR);
    }
    return ErrorCode::ARG_ERR;
  }
  const size_t ADDR_SIZE = (mem_addr_size == MemAddrLength::BYTE_8) ? 1 : 2;
  const size_t TOTAL_SIZE = ADDR_SIZE + write_data.size_;
  if (TOTAL_SIZE > MSPM0_I2C_MAX_TRANSFER_SIZE)
  {
    return ErrorCode::ARG_ERR;
  }
  if (TOTAL_SIZE > stage_buffer_.size_)
  {
    return ErrorCode::ARG_ERR;
  }

  auto* tx = static_cast<uint8_t*>(stage_buffer_.addr_);
  if (ADDR_SIZE == 1)
  {
    tx[0] = static_cast<uint8_t>(mem_addr & 0xFF);
  }
  else
  {
    tx[0] = static_cast<uint8_t>((mem_addr >> 8) & 0xFF);
    tx[1] = static_cast<uint8_t>(mem_addr & 0xFF);
  }
  if (write_data.size_ > 0)
  {
    memcpy(tx + ADDR_SIZE, write_data.addr_, write_data.size_);
  }

  return Write(slave_addr, ConstRawData(tx, TOTAL_SIZE), op, in_isr);
}

ErrorCode MSPM0I2C::MemRead(uint16_t slave_addr, uint16_t mem_addr, RawData read_data,
                            ReadOperation& op, MemAddrLength mem_addr_size, bool in_isr)
{
  if (read_data.size_ > MSPM0_I2C_MAX_TRANSFER_SIZE)
  {
    return ErrorCode::ARG_ERR;
  }
  if (read_data.size_ == 0)
  {
    if (op.type != ReadOperation::OperationType::BLOCK)
    {
      op.UpdateStatus(in_isr, ErrorCode::OK);
    }
    return ErrorCode::OK;
  }

