Jiu-xiao/libxr/driver/mspm0/mspm0_i2c.cpp
  if (!mspm0_i2c_is_valid_addr7(slave_addr))
  {
    if (op.type != ReadOperation::OperationType::BLOCK)
    {
      op.UpdateStatus(in_isr, ErrorCode::ARG_ERR);
    }
    return ErrorCode::ARG_ERR;
  }

  const uint16_t ADDR7 = slave_addr;
  const size_t ADDR_SIZE = (mem_addr_size == MemAddrLength::BYTE_8) ? 1 : 2;
  auto* addr_bytes = static_cast<uint8_t*>(stage_buffer_.addr_);
  if (stage_buffer_.size_ < ADDR_SIZE)
  {
    return ErrorCode::ARG_ERR;
  }

  if (ADDR_SIZE == 1)
  {
    addr_bytes[0] = static_cast<uint8_t>(mem_addr & 0xFF);
  }
  else
  {
    addr_bytes[0] = static_cast<uint8_t>((mem_addr >> 8) & 0xFF);
    addr_bytes[1] = static_cast<uint8_t>(mem_addr & 0xFF);
  }

  auto finalize = [&](ErrorCode code)
  {
    if (op.type != ReadOperation::OperationType::BLOCK)
    {
      op.UpdateStatus(in_isr, code);
    }
    return code;
  };

  auto try_repeated_start = [&]() -> ErrorCode
  {
    ErrorCode ans = WaitControllerIdle();
    if (ans != ErrorCode::OK)
    {
      return ans;
    }

    DL_I2C_clearInterruptStatus(res_.instance, 0xFFFFFFFFU);

    const uint16_t ADDR_SENT = DL_I2C_fillControllerTXFIFO(
        res_.instance, addr_bytes, static_cast<uint16_t>(ADDR_SIZE));
    if (ADDR_SENT != ADDR_SIZE)
    {
      return ErrorCode::FAILED;
    }

    DL_I2C_startControllerTransferAdvanced(
        res_.instance, ADDR7, DL_I2C_CONTROLLER_DIRECTION_TX,
        static_cast<uint16_t>(ADDR_SIZE), DL_I2C_CONTROLLER_START_ENABLE,
        DL_I2C_CONTROLLER_STOP_DISABLE, DL_I2C_CONTROLLER_ACK_ENABLE);

    uint32_t tx_done_timeout = MSPM0_I2C_WAIT_FIFO_TIMEOUT;
    while (DL_I2C_getRawInterruptStatus(res_.instance,
                                        DL_I2C_INTERRUPT_CONTROLLER_TX_DONE) == 0U)
    {
      if (CheckControllerError() != ErrorCode::OK)
      {
        return ErrorCode::FAILED;
      }
      if (tx_done_timeout-- == 0U)
      {
        return ErrorCode::BUSY;
      }
    }
    DL_I2C_clearInterruptStatus(res_.instance, DL_I2C_INTERRUPT_CONTROLLER_TX_DONE);

    if (CheckControllerError() != ErrorCode::OK)
    {
      return ErrorCode::FAILED;
    }

    DL_I2C_startControllerTransferAdvanced(
        res_.instance, ADDR7, DL_I2C_CONTROLLER_DIRECTION_RX,
        static_cast<uint16_t>(read_data.size_), DL_I2C_CONTROLLER_START_ENABLE,
        DL_I2C_CONTROLLER_STOP_ENABLE, DL_I2C_CONTROLLER_ACK_DISABLE);

    size_t received = 0;
    auto* read_ptr = static_cast<uint8_t*>(read_data.addr_);
    while (received < read_data.size_)
    {
      uint32_t timeout = MSPM0_I2C_WAIT_FIFO_TIMEOUT;
      while (DL_I2C_isControllerRXFIFOEmpty(res_.instance))
      {
        if (CheckControllerError() != ErrorCode::OK)
        {
          return ErrorCode::FAILED;
        }
        if (timeout-- == 0)
        {
          return ErrorCode::BUSY;
        }
      }

      while (!DL_I2C_isControllerRXFIFOEmpty(res_.instance) && received < read_data.size_)
      {
        read_ptr[received++] = DL_I2C_receiveControllerData(res_.instance);
      }
    }

    uint32_t rx_done_timeout = MSPM0_I2C_WAIT_FIFO_TIMEOUT;
    while (DL_I2C_getRawInterruptStatus(res_.instance,
                                        DL_I2C_INTERRUPT_CONTROLLER_RX_DONE) == 0U)
    {
      if (CheckControllerError() != ErrorCode::OK)
      {
        return ErrorCode::FAILED;
      }
      if (rx_done_timeout-- == 0U)
      {
        return ErrorCode::BUSY;
      }
    }
    DL_I2C_clearInterruptStatus(res_.instance, DL_I2C_INTERRUPT_CONTROLLER_RX_DONE);

    ans = WaitBusIdle();
    if (ans != ErrorCode::OK)
    {
      return ans;
    }

    return CheckControllerError();
  };

  ErrorCode last_error = ErrorCode::FAILED;
  for (uint32_t attempt = 0; attempt < MSPM0_I2C_MEMREAD_RS_ATTEMPTS; ++attempt)
  {
    last_error = try_repeated_start();
    if (last_error == ErrorCode::OK)
    {
      return finalize(ErrorCode::OK);
    }
    mspm0_i2c_recover_controller(res_.instance);
  }

  for (uint32_t attempt = 0; attempt < MSPM0_I2C_MEMREAD_FALLBACK_ATTEMPTS; ++attempt)
  {
    last_error = PollingWrite7(ADDR7, addr_bytes, ADDR_SIZE);
    if (last_error == ErrorCode::OK)
    {
      last_error =
          PollingRead7(ADDR7, static_cast<uint8_t*>(read_data.addr_), read_data.size_);
      if (last_error == ErrorCode::OK)
      {
        return finalize(ErrorCode::OK);
      }
    }
    mspm0_i2c_recover_controller(res_.instance);
  }

  return finalize(last_error);
}
